🚀&nbsp; env0 had composed a PR Plan for environment [Demo-90557](https://app.env0.com/p/bcbaf700-9894-402b-a47f-36b224da3faf/environments/ef3c9a6c-9c83-43a1-8622-0303e9079a0d):
```
Plan: 2 to add, 0 to change, 1 to destroy.
```

<details>

<summary>Plan Details</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:


  # azurerm_virtual_machine.main[0] must be replaced
-/+ resource "azurerm_virtual_machine" "main" {
      + availability_set_id              = (known after apply)
      ~ id                               = "/subscriptions/ddc30188-075a-470d-a6ca-05a1987c51a3/resourceGroups/tfvmex-resources/providers/Microsoft.Compute/virtualMachines/tfvmex-vm" -> (known after apply)
      + license_type                     = (known after apply)
      ~ name                             = "tfvmex-vm" -> "tfvmex-vm-0" # forces replacement
        tags                             = {
            "env0_environment_id" = "ef3c9a6c-9c83-43a1-8622-0303e9079a0d"
            "env0_project_id"     = "bcbaf700-9894-402b-a47f-36b224da3faf"
        }
      - zones                            = [] -> null
        # (6 unchanged attributes hidden)

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      - os_profile {
          - admin_username = "testadmin" -> null
          - computer_name  = "hostname" -> null
        }
      + os_profile {
          + admin_password = (sensitive value)
          + admin_username = "testadmin"
          + computer_name  = "hostname"
          + custom_data    = (known after apply)
        }


      + storage_data_disk {
          + caching                   = (known after apply)
          + create_option             = (known after apply)
          + disk_size_gb              = (known after apply)
          + lun                       = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = (known after apply)
          + name                      = (known after apply)
          + vhd_uri                   = (known after apply)
          + write_accelerator_enabled = (known after apply)
        }


      ~ storage_os_disk {
          ~ disk_size_gb              = 30 -> (known after apply)
          ~ managed_disk_id           = "/subscriptions/ddc30188-075a-470d-a6ca-05a1987c51a3/resourceGroups/tfvmex-resources/providers/Microsoft.Compute/disks/myosdisk1" -> (known after apply)
            name                      = "myosdisk1"
          ~ os_type                   = "Linux" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
        # (2 unchanged blocks hidden)
    }


  # azurerm_virtual_machine.main[1] will be created
  + resource "azurerm_virtual_machine" "main" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = true
      + delete_os_disk_on_termination    = true
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "westeurope"
      + name                             = "tfvmex-vm-1"
      + network_interface_ids            = [
          + "/subscriptions/ddc30188-075a-470d-a6ca-05a1987c51a3/resourceGroups/tfvmex-resources/providers/Microsoft.Network/networkInterfaces/tfvmex-nic",
        ]
      + resource_group_name              = "tfvmex-resources"
      + tags                             = {
          + "env0_environment_id" = "ef3c9a6c-9c83-43a1-8622-0303e9079a0d"
          + "env0_project_id"     = "bcbaf700-9894-402b-a47f-36b224da3faf"
        }
      + vm_size                          = "Standard_DS1_v2"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      + os_profile {
          + admin_password = (sensitive value)
          + admin_username = "testadmin"
          + computer_name  = "hostname"
          + custom_data    = (known after apply)
        }

      + os_profile_linux_config {
          + disable_password_authentication = false
        }

      + storage_data_disk {
          + caching                   = (known after apply)
          + create_option             = (known after apply)
          + disk_size_gb              = (known after apply)
          + lun                       = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = (known after apply)
          + name                      = (known after apply)
          + vhd_uri                   = (known after apply)
          + write_accelerator_enabled = (known after apply)
        }

      + storage_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "myosdisk1"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

```
</details>

  ```
Monthly cost change for smsilva/terraform/azure/virtual-machine/.tf-plan
Amount:  +$51.10 ($51.10 -> $102)
Percent: +100%
```

<details>

<summary>Cost Estimation Details</summary>

```
Project: smsilva/terraform/azure/virtual-machine/.tf-plan

+ azurerm_virtual_machine.main[1]
  +$51.10

    + Instance usage (pay as you go, Standard_DS1_v2)
      +$49.57

    + Ultra disk reservation (if unattached)
      Monthly cost depends on usage
        +$5.69 per vCPU

    + storage_os_disk
    
        + Storage (S4)
          +$1.54
    
        + Disk operations
          Monthly cost depends on usage
            +$0.0005 per 10k operations

Monthly cost change for smsilva/terraform/azure/virtual-machine/.tf-plan
Amount:  +$51.10 ($51.10 -> $102)
Percent: +100%

----------------------------------
Key: ~ changed, + added, - removed

To estimate usage-based resources use --usage-file, see https://infracost.io/usage-file
```
</details>

  
[Full Plan Logs on env0](https://app.env0.com/p/bcbaf700-9894-402b-a47f-36b224da3faf/environments/ef3c9a6c-9c83-43a1-8622-0303e9079a0d/deployments/20b00ebe-4cc3-47c6-a223-b4a7dc326567)